export const IDEA_ADD_ERROR_MESSAGES: Record<number, string> = {
  40902: '이미 아이디어를 등록했으므로 등록이 불가합니다.',
  40903: '이미 팀이 존재하므로 아이디어 등록이 불가합니다.',
  40406: '해당 사용자를 찾을 수 없습니다.',
  40409: '해당 아이디어 주제를 찾을 수 없습니다.',
  40016: '팀원 수는 6명을 초과할 수 없습니다. 다시 확인해주세요.',
  40017: '기획자는 1명을 초과할 수 없습니다. 다시 확인해주세요.',
  40018: '디자이너는 1명을 초과할 수 없습니다. 다시 확인해주세요.',
  40019: '프론트엔드는 3명을 초과할 수 없습니다. 다시 확인해주세요.',
  40020: '백엔드는 3명을 초과할 수 없습니다. 다시 확인해주세요.',
  40025: '팀원 수는 최소 3명 이상이어야 합니다. 다시 확인해주세요.',
};

export const IDEA_APPLY_ERROR_MESSAGES: Record<number, string> = {
  40406: '해당 사용자를 찾을 수 없습니다.',
  40408: '해당 아이디어를 찾을 수 없습니다.',
  40015: '귀하는 이미 팀이 존재합니다. 팀 구성을 확인해주세요.',
  40021: '해당 파트의 모집이 마감되었습니다.',
  40022: '해당 아이디어는 이미 지원한 아이디어입니다.',
  40023: '현재 아이디어 지원 기간이 아닙니다.',
  40410: '시스템 설정을 찾을 수 없습니다. 운영진에게 문의하세요.',
};